---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Water Properties
Water Class See Also Send Feedback
---

The Water type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Water" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Water" schema. |
|  | WaterBumpAmount | The property labeled "Wave Height" from the "Water" schema. |
|  | WaterColorByObject | The property labeled "Custom Color" from the "Water" schema. |
|  | WaterTintColor | The property labeled "Custom Color" from the "Water" schema. |
|  | WaterTintEnable | The property labeled "Color" from the "Water" schema. |
|  | WaterType | The property labeled "Type" from the "Water" schema. |

# See Also

Water Class

Autodesk.Revit.DB.Visual Namespace